let categories = ["Смартфони", "Ноутбуки", "ТВ", "Одяг", "Спорт"];

let products = [
  {
    id: 1,
    name: "Iphone 10",
    category: "Смартфони",
    price: 13200,
    about:
      "Apple iPhone 10 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 2,
    name: "Iphone 11",
    category: "Смартфони",
    price: 23100,
    about:
      "Apple iPhone 11 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 3,
    name: "Iphone 12 Pro",
    category: "Смартфони",
    price: 33100,
    about:
      "Apple iPhone 12 Pro - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 4,
    name: "Iphone 14",
    category: "Смартфони",
    price: 43100,
    about:
      "Apple iPhone 14 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 5,
    name: "Samsung S20",
    category: "Смартфони",
    price: 10200,
    about:
      "Samsung S20 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 6,
    name: "Nokia 2110",
    category: "Смартфони",
    price: 200,
    about:
      "Nokia 2110 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 7,
    name: "MacBook 2021",
    category: "Ноутбуки",
    price: 33200,
    about:
      "MacBook 2021 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 8,
    name: "Acer ML3000",
    category: "Ноутбуки",
    price: 12100,
    about:
      "Acer ML3000 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 9,
    name: "Dell Aspire 12",
    category: "Ноутбуки",
    price: 24200,
    about:
      "Dell Aspire 12 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 10,
    name: "HP Velure 2000",
    category: "Ноутбуки",
    price: 13100,
    about:
      "HP Velure 2000 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 11,
    name: "Samsung S20",
    category: "Смартфони",
    price: 10200,
    about:
      "Samsung S20 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 12,
    name: "Nokia 2110",
    category: "Смартфони",
    price: 200,
    about:
      "Nokia 2110 - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 13,
    name: "Toshiba JS60' QLED",
    category: "ТВ",
    price: 43100,
    about:
      "Toshiba JS60' QLED - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 14,
    name: "Samsung UV43`",
    category: "ТВ",
    price: 24200,
    about:
      "Samsung UV43` - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 15,
    name: "Philips MLD 50'",
    category: "ТВ",
    price: 26500,
    about:
      "Philips MLD 50' - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 16,
    name: "Футболка чол XXL",
    category: "Одяг",
    price: 300,
    about:
      "Футболка чол XXL - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 17,
    name: "Футболка жін M",
    category: "Одяг",
    price: 301,
    about:
      "Футболка жін M - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 18,
    name: "Костюм чоловічий D&G",
    category: "Одяг",
    price: 1000,
    about:
      "Костюм чоловічий D&G - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 19,
    name: "Жіноча юбка Collins",
    category: "Одяг",
    price: 560,
    about:
      "Жіноча юбка Collins - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 20,
    name: "Мяч футбольний Реал Мадрид",
    category: "Спорт",
    price: 350,
    about:
      "Мяч футбольний Реал Мадрид - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 21,
    name: "Кімоно",
    category: "Спорт",
    price: 500,
    about:
      "Кімоно - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 22,
    name: "Боксерські рукавиці`",
    category: "Спорт",
    price: 600,
    about:
      "Боксерські рукавиці` - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 23,
    name: "Спортивний костюм Adidas",
    category: "Спорт",
    price: 1200,
    about:
      "Спортивний костюм Adidas' - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 24,
    name: "Капа бокс",
    category: "Спорт",
    price: 50,
    about:
      "Капа бокс - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },

  {
    id: 25,
    name: "Форма Манчестер Сіті",
    category: "Спорт",
    price: 1400,
    about:
      "Форма Манчестер Сіті - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 26,
    name: "Баскетбольний мяч",
    category: "Спорт",
    price: 750,
    about:
      "аскетбольний мяч - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
  {
    id: 27,
    name: "Жіноча юбка Collins",
    category: "Одяг",
    price: 560,
    about:
      "Жіноча юбка Collins - втілення кращих інноваційних рішень. Абсолютно новий\n" +
      "дизайн з переосмисленої системою управління. Безрамковий дизайн виводить досвід використання на новий рівень.\n" +
      "Корпус зі скла і металу. Досконале апаратне ядро, завдяки найпотужнішою внутрішньої 64 бітної архітектури. Разюче\n" +
      "поліпшена найпопулярніша в світі мобільна камера. Саме таким бачить свій флагманський смартфон компанія Apple в\n" +
      "2017 році.",
  },
];

let productSection = document.querySelector(".products");
let categoriesBox = document.querySelector(".categories");
let aboutProduct = document.querySelector(".aboutProduct");

let activeCategory = null;
let activeProduct = null;
const categoriesMurkUp = document.createElement("ul");
categoriesMurkUp.className = "categories__list";
categoriesMurkUp.addEventListener("click", function (event) {
  activeCategory = event.target.innerText;

  let productMurkUp = document.createElement("div");
  if (categories.includes(activeCategory) && activeCategory !== null) {
    productSection.innerHTML = "";
    for (let product of products) {
      if (product.category === activeCategory) {
        productMurkUp.innerHTML += `<div class="produsts__item">
                                        <p class="produsts__title">${product.name}</p>
                                        <p class="produsts__price">${product.price}</p>
                                        <button class="produsts__buyButton" value=${product.id} onclick=setActiveProduct(${product.id})>Детально</button>
                                    </div>`;
      }
    }
    productSection.append(productMurkUp);
  }
});
let listMarkup = "";
for (let i = 0; i < categories.length; i++) {
  let a = document.createElement("a");
  a.className = "categories__link";
  a.href = "#";
  listMarkup += `<a class="categories__link" href='#'>
                    <li class="categories__item">
                        ${categories[i]}
                    </li>
                  </a>`;
}

categoriesMurkUp.innerHTML = listMarkup;
categoriesBox.append(categoriesMurkUp);

function setActiveProduct(item) {
  activeProduct = item;
  let aboutContainer = document.createElement("div");
  aboutContainer.className = "aboutProduct__about";
  aboutProduct.innerHTML = "";
  for (let product of products) {
    if (product.id === activeProduct) {
      aboutContainer.innerHTML += product.about;
      aboutContainer.innerHTML += `<br><button class="aboutProduct__button" onclick=buyProduct()>Купити</button>`;
    }
  }
  aboutProduct.append(aboutContainer);
}

function buyProduct() {
  alert(`Товар куплено`);
  window.location.assign("index.html");
}
